{
  "settingCount": 12,
  "platforms": "windows10",
  "name": "🔴 – 💾 BitLocker – PIN",
  "priorityMetaData": null,
  "createdDateTime": "2026-01-31T14:13:58.0702421Z",
  "creationSource": null,
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateDisplayName": "BitLocker",
    "templateId": "46ddfc50-d10f-4867-b852-9434254b3bff_1",
    "templateFamily": "endpointSecurityDiskEncryption",
    "templateDisplayVersion": "Version 1"
  },
  "id": "033a7a37-8a7c-4d9d-a017-a9dbc729172c",
  "technologies": "mdm",
  "description": "4.11.7.1.1 (BL) 4.11.7.1.2 (BL) 4.11.7.1.3 (BL) 4.11.7.1.4 (BL) 4.11.7.1.5 (BL) 4.11.7.1.6 (BL) 4.11.7.1.7 (BL) 4.11.7.1.8 (BL) 4.11.7.2.1 (BL) 4.11.7.2.2 (BL) 4.11.7.2.3 (BL) 4.11.7.2.4 (BL) 4.11.7.2.5 (BL) 4.11.7.2.6 (BL) 4.11.7.2.7 (BL) 4.11.7.2.8 (BL) 4.11.7.2.9 (BL) 4.11.7.2.10 (BL) 4.11.7.2.11 (BL) 4.11.7.2.12 (BL) 4.11.7.2.13 (BL) 4.11.7.2.14 (BL) 4.11.7.3.1 (BL) 4.11.7.3.2 (BL) 4.11.7.4 (BL) 4.11.7.5 (BL) 4.11.7.6 (BL)",
  "lastModifiedDateTime": "2026-01-31T14:15:05.2850286Z",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_6",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "3",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "4",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a5673a18-196d-49a0-a460-a8f35b807b45"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_0",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "5",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "0b4775b0-8f27-4d40-b68d-b4e521d91230"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength_0",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "041be1b9-62b2-478b-bb0c-fc3f712aa750",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "6",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "1eb5feff-b03f-44ab-a5ce-198de8e4741e"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenhancedpin",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_bitlocker_systemdrivesenhancedpin_0",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "9e261c1d-9eb0-4edb-a9cf-d86390683954",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "7",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "8",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "9",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "10",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5f8b6127-bc7f-469b-b903-ea3d46035448"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [
                  {
                    "settingInstanceTemplateReference": null,
                    "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                      "children": [
                        {
                          "settingInstanceTemplateReference": null,
                          "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                          "choiceSettingValue": {
                            "children": [],
                            "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_1",
                            "settingValueTemplateReference": {
                              "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                              "useTemplateDefault": false
                            }
                          },
                          "auditRuleInformation": null
                        }
                      ],
                      "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                      "settingValueTemplateReference": {
                        "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                        "useTemplateDefault": false
                      }
                    },
                    "auditRuleInformation": null
                  }
                ],
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            },
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                  "useTemplateDefault": false
                }
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    },
    {
      "id": "11",
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "28e5153b-24cb-45fd-b53d-96847b00c9a6"
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "children": [],
                "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0",
                "settingValueTemplateReference": null
              },
              "auditRuleInformation": null
            }
          ],
          "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "06f0b5be-421d-4de1-92d1-b9c9b461fa38",
            "useTemplateDefault": false
          }
        },
        "auditRuleInformation": null
      }
    }
  ]
}
