{
  "creationSource": null,
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateFamily": "endpointSecurityDiskEncryption",
    "templateDisplayVersion": "Version 1",
    "templateDisplayName": "BitLocker",
    "templateId": "46ddfc50-d10f-4867-b852-9434254b3bff_1"
  },
  "platforms": "windows10",
  "lastModifiedDateTime": "2025-10-25T18:18:14.6286386Z",
  "technologies": "mdm",
  "createdDateTime": "2025-07-25T13:32:26.7797902Z",
  "id": "5194cd09-6f55-4509-a331-af1e71241a4c",
  "name": "🔴 – 💾 BitLocker – PIN",
  "priorityMetaData": null,
  "description": "4.11.7.1.1 (BL) 4.11.7.1.2 (BL) 4.11.7.1.3 (BL) 4.11.7.1.4 (BL) 4.11.7.1.5 (BL) 4.11.7.1.6 (BL) 4.11.7.1.7 (BL) 4.11.7.1.8 (BL) 4.11.7.2.1 (BL) 4.11.7.2.2 (BL) 4.11.7.2.3 (BL) 4.11.7.2.4 (BL) 4.11.7.2.5 (BL) 4.11.7.2.6 (BL) 4.11.7.2.7 (BL) 4.11.7.2.8 (BL) 4.11.7.2.9 (BL) 4.11.7.2.10 (BL) 4.11.7.2.11 (BL) 4.11.7.2.12 (BL) 4.11.7.2.13 (BL) 4.11.7.2.14 (BL) 4.11.7.3.1 (BL) 4.11.7.3.2 (BL) 4.11.7.4 (BL) 4.11.7.5 (BL) 4.11.7.6 (BL)",
  "settingCount": 12,
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_6",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6"
          },
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_0",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a5673a18-196d-49a0-a460-a8f35b807b45"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "041be1b9-62b2-478b-bb0c-fc3f712aa750"
          },
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength_minpinlength",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": 6,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "041be1b9-62b2-478b-bb0c-fc3f712aa750"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
              }
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "0b4775b0-8f27-4d40-b68d-b4e521d91230"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "7"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b"
                },
                "children": [
                  {
                    "choiceSettingValue": {
                      "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                      "settingValueTemplateReference": {
                        "useTemplateDefault": false,
                        "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b"
                      },
                      "children": [
                        {
                          "choiceSettingValue": {
                            "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_1",
                            "settingValueTemplateReference": {
                              "useTemplateDefault": false,
                              "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b"
                            },
                            "children": []
                          },
                          "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                          "settingInstanceTemplateReference": null,
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                      ]
                    },
                    "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                    "settingInstanceTemplateReference": null,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                  }
                ]
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5f8b6127-bc7f-469b-b903-ea3d46035448"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "8"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "1f53e191-0268-4d02-92df-c9b55a0d066a"
          },
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f85aa8db-2f1b-4568-a13d-388a504ee610"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "9"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "06f0b5be-421d-4de1-92d1-b9c9b461fa38"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0",
                "settingValueTemplateReference": null,
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "28e5153b-24cb-45fd-b53d-96847b00c9a6"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "10"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe"
          },
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_1",
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe"
                },
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "11"
    }
  ]
}
