{
  "templateReference": {
    "templateFamily": "endpointSecurityAccountProtection",
    "templateDisplayVersion": "Version 1",
    "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
    "templateDisplayName": "Local admin password solution (Windows LAPS)"
  },
  "settingCount": 6,
  "description": "",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "13ff76b0-48f0-4f01-b3ab-b67045c28cd0",
  "name": "LAPS - admin.laps",
  "priorityMetaData": null,
  "createdDateTime": "2025-02-17T10:21:49.1235934Z",
  "creationSource": null,
  "lastModifiedDateTime": "2025-04-25T09:02:05.6626316Z",
  "technologies": "mdm",
  "platforms": "windows10",
  "settings": [
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92"
          },
          "value": "device_vendor_msft_laps_policies_backupdirectory_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "value": 30,
                "settingValueTemplateReference": {
                  "useTemplateDefault": false,
                  "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92"
                }
              },
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_laps_policies_passwordagedays_aad"
            }
          ]
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
        },
        "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "value": "admin.laps",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "992c7fce-f9e4-46ab-ac11-e167398859ea"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d3d7d492-0019-4f56-96f8-1967f7deabeb"
        },
        "settingDefinitionId": "device_vendor_msft_laps_policies_administratoraccountname"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01"
          },
          "value": "device_vendor_msft_laps_policies_passwordcomplexity_5",
          "children": []
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8a7459e8-1d1c-458a-8906-7b27d216de52"
        },
        "settingDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 16,
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "d08f1266-5345-4f53-8ae1-4c20e6cb5ec9"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "da7a1dbd-caf7-4341-ab63-ece6f994ff02"
        },
        "settingDefinitionId": "device_vendor_msft_laps_policies_passwordlength"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142"
          },
          "value": "device_vendor_msft_laps_policies_postauthenticationactions_3",
          "children": []
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d9282eb1-d187-42ae-b366-7081f32dcfff"
        },
        "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationactions"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 2,
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "0deb6aee-8dac-40c4-a9dd-c3718e5c1d52"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a9e21166-4055-4042-9372-efaf3ef41868"
        },
        "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationresetdelay"
      },
      "id": "5"
    }
  ]
}
