{
  "templateReference": {
    "templateFamily": "endpointSecurityAccountProtection",
    "templateDisplayVersion": "Version 1",
    "templateId": "22968f54-45fa-486c-848e-f8224aa69772_1",
    "templateDisplayName": "Local user group membership"
  },
  "settingCount": 1,
  "description": "",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "df314067-52d7-4426-8d31-0794444f1f1c",
  "name": "Local Group - Administrators",
  "priorityMetaData": null,
  "createdDateTime": "2025-02-17T10:22:38.2187581Z",
  "creationSource": null,
  "lastModifiedDateTime": "2025-06-07T11:54:12.5977509Z",
  "technologies": "mdm",
  "platforms": "windows10",
  "settings": [
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "groupSettingCollectionValue": [
                  {
                    "settingValueTemplateReference": null,
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
                        "choiceSettingCollectionValue": [
                          {
                            "settingValueTemplateReference": null,
                            "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc_administrators",
                            "children": []
                          }
                        ],
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc"
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "choiceSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action_add_update",
                          "children": []
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action"
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "choiceSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype_manual",
                          "children": [
                            {
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                              "simpleSettingCollectionValue": [
                                {
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                  "value": "admin.laps",
                                  "settingValueTemplateReference": null
                                }
                              ],
                              "settingInstanceTemplateReference": null,
                              "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_users"
                            }
                          ]
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype"
                      }
                    ]
                  }
                ],
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup"
              }
            ]
          }
        ],
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "de06bec1-4852-48a0-9799-cf7b85992d45"
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure"
      },
      "id": "0"
    }
  ]
}
