{
  "templateReference": {
    "templateDisplayName": "Microsoft Defender Antivirus",
    "templateId": "804339ad-1553-4478-a742-138fb5807418_1",
    "templateFamily": "endpointSecurityAntivirus",
    "templateDisplayVersion": "Version 1"
  },
  "technologies": "mdm,microsoftSense",
  "platforms": "windows10",
  "name": "🔴 – 🛡️ Microsoft Defender – Antivirus",
  "lastModifiedDateTime": "2025-11-02T11:57:02.3846583Z",
  "id": "f7c81390-e6fa-4d02-99de-564ef0b4a32a",
  "createdDateTime": "2025-07-25T13:32:25.8270855Z",
  "creationSource": null,
  "settingCount": 24,
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "description": "22.1 (L1) Ensure 'Allow Behavior Monitoring' is set to 'Allowed'\n22.2 (L1) Ensure 'Allow Email Scanning' is set to 'Allowed'\n22.3 (L1) Ensure 'Allow Full Scan Removable Drive Scanning' is set to 'Allowed'\n22.4 (L1) Ensure 'Allow Realtime Monitoring' is set to 'Allowed'\n22.5 (L1) Ensure 'Allow scanning of all downloaded files and attachments' is set to 'Allowed'\n22.6 (L1) Ensure 'Allow Script Scanning' is set to 'Allowed'\n22.26 (L1) Ensure 'Enable Network Protection' is set to 'Enabled (block mode)'\n22.29 (L1) Ensure 'PUA Protection' is set to 'PUA Protection on'\n\n",
  "settings": [
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "b0d9ee81-de6a-4750-86d7-9397961c9852"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "fdf107fd-e13b-4507-9d8f-db4d93476af9"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "366c5727-629b-4a81-b50b-52f90282fa2c"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f8f28442-0a6b-4b52-b42c-d31d9687c1cf"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7b8c858c-a17d-4623-9e20-f34b851670ce"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles"
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring"
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "afbc322b-083c-4281-8242-ebbb91398b41"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "ed077fee-9803-44f3-b045-aab34d8e6d52"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowonaccessprotection"
      },
      "id": "7"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection"
      },
      "id": "8"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning"
      },
      "id": "9"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "0170a900-b0bc-4ccc-b7ce-dda9be49189b"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "4b6c9739-4449-4006-8e5f-3049136470ea"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowuseruiaccess"
      },
      "id": "10"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "010779d1-edd4-441d-8034-89ad57a863fe"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan"
      },
      "id": "11"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c7a37009-c16e-4145-84c8-89a8c121fb15"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "517b4e84-e933-42b9-b92f-00e640b1a82d"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel"
      },
      "id": "12"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f61c2788-14e4-4e80-a5a7-bf2ff5052f63"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 50,
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "608f1561-b603-46bd-bf5f-0b9872002f75"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout"
      },
      "id": "13"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection"
      },
      "id": "14"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c0135c2a-f802-44f4-9b71-b0b976411b8c"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "2d790211-18cb-4e32-b8cc-97407e2c0b45"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection"
      },
      "id": "15"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f5ff00a4-e5c7-44cf-a650-9c7619ff1561"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "6b4e3497-cfbb-4761-a152-de935bbf3f07"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_realtimescandirection"
      },
      "id": "16"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "27ca2652-46f3-4cc7-83f2-bf85ff722d84"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_scanparameter_1",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "70c8f42e-ee6a-4ef1-a070-cb0e9d472581"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_scanparameter"
      },
      "id": "17"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "784a4af1-33fa-45f2-b945-138b7ff3bcb6"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 600,
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "5d5c55c8-1a4e-4272-830d-8dc64cd3ac03"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulequickscantime"
      },
      "id": "18"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "087d3362-7e78-4983-96bc-1f4ea183f0e4"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_schedulescanday_0",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "7f4d9dda-6d48-4353-90ca-9fa7164c7215"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday"
      },
      "id": "19"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "89879f27-6b7d-44d4-a08e-0a0de3e9663d"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 4,
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "0af6bbed-a74a-4d08-8587-b16b10b774cb"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_signatureupdateinterval"
      },
      "id": "20"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "bc47ce7d-a251-4cae-a8a2-6e8384904ab7"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_3",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "826ed4b6-e04f-4975-9d23-6f0904b0d87e"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent"
      },
      "id": "21"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5f9a9c65-dea7-4987-a5f5-b28cfd9762ba"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_0",
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "3a9774b2-3143-47eb-bbca-d73c0ace2b7e"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disablelocaladminmerge"
      },
      "id": "22"
    },
    {
      "settingInstance": {
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "66d36baa-74ee-498d-958a-af477008c850"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 600,
          "settingValueTemplateReference": {
            "useTemplateDefault": false,
            "settingValueTemplateId": "a204c511-6130-473a-b05f-93bda521aba9"
          }
        },
        "auditRuleInformation": null,
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescantime"
      },
      "id": "23"
    }
  ]
}
