{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-02-23T18:43:36.0286214Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-02-23T18:43:36.0286214Z","name":"Application - Default apps","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"e2053746-fe9b-48a0-90f8-3ba79c8cadd4","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_applicationdefaults_defaultassociationsconfiguration","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4NCjxEZWZhdWx0QXNzb2NpYXRpb25zPg0KICA8QXNzb2NpYXRpb24gSWRlbnRpZmllcj0ibWFpbHRvIiBQcm9nSWQ9Ik91dGxvb2suVVJMLm1haWx0by4xNSIgQXBwbGljYXRpb25OYW1lPSJPdXRsb29rIiAvPg0KICA8QXNzb2NpYXRpb24gSWRlbnRpZmllcj0iLmVtbCIgUHJvZ0lkPSJPdXRsb29rLkZpbGUuZW1sLjE1IiBBcHBsaWNhdGlvbk5hbWU9Ik91dGxvb2siIC8+DQo8L0RlZmF1bHRBc3NvY2lhdGlvbnM+"}}}]}
