{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-06-07T17:18:23.8883774Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-06-07T17:23:29.7730313Z","name":"Multi-user - Security Key Login","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"6fa34467-0d9e-42b6-ae91-27988749919a","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_passportforwork_securitykey_usesecuritykeyforsignin","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_passportforwork_securitykey_usesecuritykeyforsignin_0","children":[]}}}]}
