{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-20T11:05:33.3151675Z","creationSource":null,"description":"Security Baseline for Windows 10 and later\nVersion 24H2\nOriginal","lastModifiedDateTime":"2025-07-20T11:36:31.8084268Z","name":"Security Baseline - System Services","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":4,"technologies":"mdm","id":"b1c04ee7-dbcb-4303-94e3-d9a200357774","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode_4","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode_4","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode_4","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode_4","children":[]}}}]}
