{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-27T06:19:02.0424416Z","creationSource":null,"description":"Determines whether to require domain users to elevate when setting a network's location.","lastModifiedDateTime":"2025-07-27T06:26:38.06694Z","name":"Security - Network Location","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"715e4b44-91a7-456d-ba78-0392242e1f45","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation_1","children":[]}}}]}
