{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-27T06:18:01.4181863Z","creationSource":null,"description":"Determines whether a user can install and configure the Network Bridge. The Network Bridge allows users to create a layer 2 MAC bridge, enabling them to connect two or more network segments together.\n\nA Network Bridge can connect two or more network segments, allowing unauthorized access or exposure of sensitive data in another network segment.\n","lastModifiedDateTime":"2025-07-27T06:29:04.4141589Z","name":"Security - Network Bridge on Domain Network","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"f5df7129-9781-4b5b-b274-4c82b9c07cae","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge_1","children":[]}}}]}
