{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-27T06:16:26.5529119Z","creationSource":null,"description":"Determines whether to require user authentication for remote connections to the RD Session Host server by using Network Level Authentication.\n\nBy completing user authentication before creating a remote desktop connection, Network-Level Authentication requires fewer remote computer resources and thus protects the remote computer from denial of service attacks. It also protects the remote computer from attacks that abuse accessibility features over login sessions.","lastModifiedDateTime":"2025-07-27T06:28:06.9019598Z","name":"Security - Network-Level Authentication for Remote Connections ","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"21e2a437-859b-45e1-a832-a2f576a63fa5","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_terminalserver_ts_user_authentication_policy","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_terminalserver_ts_user_authentication_policy_1","children":[]}}}]}
