{
  "createdDateTime": "2025-06-07T12:31:07.54726Z",
  "settingCount": 8,
  "platforms": "windows10",
  "name": "Firewall - Baseline",
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateFamily": "endpointSecurityFirewall",
    "templateId": "6078910e-d808-4a9f-a51d-1b8a7bacb7c0_1",
    "templateDisplayVersion": "Version 1",
    "templateDisplayName": "Windows Firewall"
  },
  "description": "",
  "lastModifiedDateTime": "2025-06-07T12:31:07.54726Z",
  "creationSource": null,
  "technologies": "mdm,microsoftSense",
  "priorityMetaData": null,
  "id": "b381d145-5eb8-409c-9ddb-da9340875a63",
  "settings": [
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e7a56c46-ef6b-453b-a280-5c5677eed4b2"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_crlcheck",
        "choiceSettingValue": {
          "children": [],
          "value": "vendor_msft_firewall_mdmstore_global_crlcheck_0",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "95ffe5ce-c873-420f-aeba-b740b513251b",
            "useTemplateDefault": false
          }
        }
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "38329af6-2670-4a71-972d-482010ca97fc"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_disablestatefulftp",
        "choiceSettingValue": {
          "children": [],
          "value": "vendor_msft_firewall_mdmstore_global_disablestatefulftp_true",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "559f6e01-53a9-4c10-9f10-d09d8fe7f903",
            "useTemplateDefault": false
          }
        }
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7714c373-a19a-4b64-ba6d-2e9db04a7684"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "choiceSettingValue": {
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_1",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_0",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogdroppedpackets_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogignoredrules_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_enablelogsuccessconnections_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall.log",
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_logfilepath"
            },
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "value": 1024,
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_logmaxfilesize"
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_shielded",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_shielded_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_true",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
                  "useTemplateDefault": false
                }
              }
            }
          ],
          "value": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "120c5dbe-0c88-46f0-b897-2c996d3e5277",
            "useTemplateDefault": false
          }
        }
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "290a576c-b314-4305-98e7-ac98ad5452c4"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_enablepacketqueue",
        "choiceSettingCollectionValue": [
          {
            "children": [],
            "value": "vendor_msft_firewall_mdmstore_global_enablepacketqueue_0",
            "settingValueTemplateReference": null
          }
        ]
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 300,
          "settingValueTemplateReference": {
            "settingValueTemplateId": "39a12cfe-2766-40a1-b63f-292ead946168",
            "useTemplateDefault": false
          }
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "2663b68f-6624-4cf2-ba68-9d355b086824"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_saidletime"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a49fb169-715e-42ea-9916-35ac9de66f69"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding",
        "choiceSettingValue": {
          "children": [],
          "value": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "25ecf79d-adde-4cbd-948b-c1095058a6ee",
            "useTemplateDefault": false
          }
        }
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "1c14f914-69bb-49f8-af5b-e29173a6ee95"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "choiceSettingValue": {
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogdroppedpackets_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogignoredrules_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_enablelogsuccessconnections_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall.log",
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_logfilepath"
            },
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "value": 1024,
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_logmaxfilesize"
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_shielded",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_shielded_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_true",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
                  "useTemplateDefault": false
                }
              }
            }
          ],
          "value": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "9d55dfae-d55f-4f2a-af03-9a9524f61e76",
            "useTemplateDefault": false
          }
        }
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e2714734-708e-4286-8ae9-d56821e306a3"
        },
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "choiceSettingValue": {
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogdroppedpackets_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogignoredrules_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_enablelogsuccessconnections_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true",
                "settingValueTemplateReference": null
              }
            },
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                "value": "%systemroot%\\system32\\LogFiles\\Firewall\\pfirewall.log",
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_logfilepath"
            },
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                "value": 1024,
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_logmaxfilesize"
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_shielded",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_shielded_false",
                "settingValueTemplateReference": null
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications",
              "choiceSettingValue": {
                "children": [],
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_true",
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
                  "useTemplateDefault": false
                }
              }
            }
          ],
          "value": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "c38694c7-51a4-4a35-8f64-b10866a04776",
            "useTemplateDefault": false
          }
        }
      },
      "id": "7"
    }
  ]
}
