{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T17:31:43.8489382Z","creationSource":null,"description":"CIS Apple MacOS 15.0 Sequoia Intune Benchmark v1.0.0 - 05-30-2025\n\n2.3.1.1 Ensure \"User Enters Missing Info\" is set to \"True\"\n2.3.1.2 Ensure \"Enable\" is set to \"On\"\n2.3.1.3 Ensure \"Defer Force At User Login Max Bypass Attempts\" is set to \"0\"\n2.3.1.4 Ensure \"Show Recovery Key\" is set to \"Disabled\"2.3.1.5 Ensure \"Force Enable In Setup Assistant\" is set to \"True\"\n2.3.2.1 Ensure \"Prevent FileVault From Being Disabled\" is set to \"True\"\n\n","lastModifiedDateTime":"2025-08-10T17:35:56.7289491Z","name":"FIleVault - CIS Level 1","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm,appleRemoteManagement","id":"e8be0f28-dc56-423b-8dff-5c0cbf78f135","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.mcx.filevault2_com.apple.mcx.filevault2","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"com.apple.mcx.filevault2_deferforceatuserloginmaxbypassattempts","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":0}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.mcx.filevault2_enable","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.mcx.filevault2_enable_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.mcx.filevault2_forceenableinsetupassistant","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.mcx.filevault2_forceenableinsetupassistant_true","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.mcx.filevault2_showrecoverykey","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.mcx.filevault2_showrecoverykey_false","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.mcx.filevault2_userentersmissinginfo","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.mcx.filevault2_userentersmissinginfo_true","children":[]}}]}]}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.mcx_com.apple.mcx-fdefilevaultoptions","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.mcx_dontallowfdedisable","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.mcx_dontallowfdedisable_true","children":[]}}]}]}}]}