{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T18:15:04.3289707Z","creationSource":null,"description":"CIS Apple MacOS 15.0 Sequoia Intune Benchmark v1.0.0 - 05-30-2025\n\n2.9.1.4 Ensure \"Min Complex Characters\" is set to \"1\" or more\n2.9.1.9 Ensure \"Allow Simple Passcode\" is set to \"False\"","lastModifiedDateTime":"2025-08-10T18:15:04.3289707Z","name":"Passcode - CIS Level 2","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"ccbd751b-92f7-4c1c-97a0-234e2140bee7","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_allowsimple","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.mobiledevice.passwordpolicy_allowsimple_false","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_mincomplexchars","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":1}}]}]}}]}