{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T17:46:50.0963869Z","creationSource":null,"description":"CIS Apple MacOS 15.0 Sequoia Intune Benchmark v1.0.0 - 05-30-2025\n\n2.7.1 Ensure \"Removal Password\" is absent or is securely configured with restricted access","lastModifiedDateTime":"2025-08-10T17:46:50.0963869Z","name":"Profile Removal Password - CIS Level 1","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"2b9cafa7-96b3-427f-85c9-2575ea9f039c","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.profileremovalpassword_com.apple.profileremovalpassword","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"com.apple.profileremovalpassword_removalpassword","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSecretSettingValue","settingValueTemplateReference":null,"value":"84723fe0-248c-4e3b-bbe6-c65046ddb0b4","valueState":"encryptedValueToken"}}]}]}}]}