{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T18:18:14.7198688Z","creationSource":null,"description":"CIS Apple MacOS 15.0 Sequoia Intune Benchmark v1.0.0 - 05-30-2025\n\n2.10.1 Ensure \"Automatically Install App Updates\" is set to \"True\"\n2.10.3 Ensure \"Automatic Check Enabled\" is set to \"True\n2.10.5 Ensure \"Automatic Download\" is set to \"True\" \n\n","lastModifiedDateTime":"2025-08-10T18:18:14.7198688Z","name":"Software Update - CIS Level 1","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"4719e00d-6f99-4fca-ad3f-3872be8a22f8","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.softwareupdate_com.apple.softwareupdate","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.softwareupdate_automaticcheckenabled","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.softwareupdate_automaticcheckenabled_true","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.softwareupdate_automaticdownload","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.softwareupdate_automaticdownload_true","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.softwareupdate_automaticallyinstallappupdates","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.softwareupdate_automaticallyinstallappupdates_true","children":[]}}]}]}}]}