{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T18:28:58.2442825Z","creationSource":null,"description":"CIS Apple MacOS 15.0 Sequoia Intune Benchmark v1.0.0 - 05-30-2025\n\n2.12.1.1 Ensure \"Enable XProtect Malware Upload\" is set to \"Disabled\"\n2.12.1.2 Ensure Gatekeeper is configured for application installs from Identified Developers only\n","lastModifiedDateTime":"2025-08-10T18:28:58.2442825Z","name":"System Policy Control - CIS Level 1","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"c9d35603-6dcc-4084-867e-dcd65175c6c2","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.systempolicy.control_com.apple.systempolicy.control","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.systempolicy.control_enableassessment","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.systempolicy.control_enableassessment_true","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.systempolicy.control_enablexprotectmalwareupload","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.systempolicy.control_enablexprotectmalwareupload_false","children":[]}}]}]}}]}