{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T18:29:51.2625687Z","creationSource":null,"description":"CIS Apple MacOS 15.0 Sequoia Intune Benchmark v1.0.0 - 05-30-2025\n\n2.12.1.3 Ensure Gatekeeper is configured to block all user application installs","lastModifiedDateTime":"2025-08-10T18:29:51.2625687Z","name":"System Policy Control - CIS Level 2","platforms":"macOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"547878e4-d24f-4b33-a656-20b5d720a996","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.systempolicy.control_com.apple.systempolicy.control","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.systempolicy.control_allowidentifieddevelopers","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.systempolicy.control_allowidentifieddevelopers_false","children":[]}}]}]}}]}