{
  "displayName": "301 - Users - Block - Microsoft Azure",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeUserActions": [],
      "excludeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "797f4846-ba00-4fd7-ba43-dac1f8f63013"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "includeUsers": [
        "All"
      ],
      "excludeGroups": [
        "<EligibleAdminsGroup>",
        "<MicrosoftAzureExclusions>",
        "<ServiceAccountsGroup>"
      ],
      "excludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32",
        "a92aed5d-d78a-4d16-b381-09adb37eb3b0",
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "c4e39bd9-1100-46d3-8c65-fb160da0071f",
        "b0f54661-2d74-4c50-afa3-1ec803f12efe",
        "158c047a-c907-4556-b7ef-446551a6b5f7",
        "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "62e90394-69f5-4237-9190-012177145e10",
        "f2ef992c-3afb-46b9-b7cf-a126ee74c451",
        "729827e3-9c14-49f7-bb1b-9608f156bbb8",
        "966707d0-3269-4727-9be2-8c3a10f19b9d",
        "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
        "e8611ab8-c189-46e8-94e1-60213ab1f814",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "69091246-20e8-4a56-aa4d-066075b2a7a8",
        "fe930be7-5e62-47db-91af-98c3a49a38b1",
        "17315797-102d-40b4-93e0-432062caca18",
        "8424c6f0-a189-499e-bbd0-26c1753c96d4",
        "3a2c62db-5318-420d-8d74-23affee5d9d5"
      ],
      "includeGroups": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind": "all"
        },
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      }
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ],
    "termsOfUse": [],
    "customAuthenticationFactors": []
  }
}
