{
  "displayName": "507 - Guests - Require - Multifactor Authentication for Medium User risk",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "users": {
      "includeUsers": [],
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "excludeGroups": [],
      "excludeRoles": [],
      "includeGroups": [],
      "includeRoles": [],
      "includeGuestsOrExternalUsers": {
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider",
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind": "all"
        }
      },
      "excludeGuestsOrExternalUsers": null
    },
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "applicationFilter": null,
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": []
    },
    "userRiskLevels": [
      "medium"
    ],
    "platforms": null,
    "locations": null,
    "devices": null,
    "deviceStates": null,
    "times": null,
    "clientApplications": null
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [],
    "termsOfUse": [],
    "customAuthenticationFactors": [],
    "authenticationStrength": {
      "policyType": "builtIn",
      "id": "00000000-0000-0000-0000-000000000002"
    }
  },
  "sessionControls": null
}
