{
  "displayName": "504 - Guests - Require - Sign-in frequency",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "users": {
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "membershipKind": "all",
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants"
        },
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      },
      "excludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32",
        "a92aed5d-d78a-4d16-b381-09adb37eb3b0"
      ],
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "includeUsers": [],
      "includeGroups": [],
      "excludeGroups": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": null
    },
    "clientAppTypes": [
      "all"
    ],
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    }
  },
  "sessionControls": {
    "signInFrequency": {
      "isEnabled": true,
      "value": 2,
      "frequencyInterval": "timeBased",
      "authenticationType": "primaryAndSecondaryAuthentication",
      "type": "hours"
    }
  }
}
