{
  "displayName": "505 - Guests - Require - Multifactor Authentication",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "platforms": null,
    "locations": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "applicationFilter": null
    },
    "users": {
      "includeGuestsOrExternalUsers": {
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind": "all"
        },
        "guestOrExternalUserTypes": "internalGuest,b2bCollaborationGuest,b2bCollaborationMember,b2bDirectConnectUser,otherExternalUser,serviceProvider"
      },
      "includeUsers": [],
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "excludeGroups": [],
      "excludeRoles": [
        "d29b2b05-8046-44ba-8758-1e26182fcf32",
        "a92aed5d-d78a-4d16-b381-09adb37eb3b0"
      ],
      "includeGroups": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": null
    },
    "clientApplications": null,
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "deviceStates": null,
    "devices": null,
    "times": null
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [],
    "termsOfUse": [],
    "authenticationStrength": {
      "id": "00000000-0000-0000-0000-000000000002"
    },
    "customAuthenticationFactors": []
  },
  "sessionControls": null
}
