{
  "displayName": "🔴 – 💼 Local Identities – Lockout Behaviour",
  "description": null,
  "omaSettings": [
    {
      "displayName": "AccountLockoutPolicy",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/DeviceLock/AccountLockoutPolicy",
      "value": "PGEvPg==",
      "odataType": "#microsoft.graph.omaSettingStringXml"
    }
  ]
}
