{
  "displayName": "Multi-user - Config",
  "description": null,
  "omaSettings": [
    {
      "displayName": "EnableSharedPCModeWithOneDriveSync",
      "description": null,
      "omaUri": "./Vendor/MSFT/SharedPC/EnableSharedPCModeWithOneDriveSync",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "AccountModel",
      "description": null,
      "omaUri": "./Vendor/MSFT/SharedPC/AccountModel",
      "value": 1,
      "odataType": "#microsoft.graph.omaSettingInteger"
    },
    {
      "displayName": "RestrictLocalStorage",
      "description": null,
      "omaUri": "./Vendor/MSFT/SharedPC/RestrictLocalStorage",
      "value": false,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "SignInOnResume",
      "description": null,
      "omaUri": "./Vendor/MSFT/SharedPC/SignInOnResume",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "SetPowerPolicies",
      "description": null,
      "omaUri": "./Vendor/MSFT/SharedPC/SetPowerPolicies",
      "value": false,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "SetEduPolicies",
      "description": null,
      "omaUri": "./Vendor/MSFT/SharedPC/SetEduPolicies",
      "value": false,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    }
  ]
}
