{
  "displayName": "Security - Local Storage of Passwords",
  "description": "Determines whether Credential Manager saves passwords or credentials locally for later use when it gains domain authentication.\n\n1 = Disabled | 0 = Enabled\n\nhttps://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-localpoliciessecurityoptions",
  "omaSettings": [
    {
      "displayName": "NetworkAccess_DoNotAllowStorageOfPasswordsAndCredentialsForNetworkAuthentication",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/LocalPoliciesSecurityOptions/NetworkAccess_DoNotAllowStorageOfPasswordsAndCredentialsForNetworkAuthentication",
      "value": 1,
      "odataType": "#microsoft.graph.omaSettingInteger"
    }
  ]
}
