{
  "displayName": "Windows Hello - Entra hybrid joined",
  "description": null,
  "omaSettings": [
    {
      "displayName": "UseBiometrics",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/PassportForWork/Biometrics/UseBiometrics",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "FacialFeaturesUseEnhancedAntiSpoofing",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/PassportForWork/Biometrics/FacialFeaturesUseEnhancedAntiSpoofing",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "EnableESSwithSupportedPeripherals",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/PassportForWork/Biometrics/EnableESSwithSupportedPeripherals",
      "value": 1,
      "odataType": "#microsoft.graph.omaSettingInteger"
    },
    {
      "displayName": "UseSecurityKeyForSignin",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/PassportForWork/SecurityKey/UseSecurityKeyForSignin",
      "value": 1,
      "odataType": "#microsoft.graph.omaSettingInteger"
    },
    {
      "displayName": "DisablePostLogonProvisioning",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/PassportForWork/{TenantID}/Policies/DisablePostLogonProvisioning",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "UseRemotePassport",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/PassportForWork/{TenantID}/Policies/Remote/UseRemotePassport",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "UsePassportForWork",
      "description": null,
      "omaUri": "./User/Vendor/MSFT/PassportForWork/{TenantID}/Policies/UsePassportForWork",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "RequireSecurityDevice",
      "description": null,
      "omaUri": "./User/Vendor/MSFT/PassportForWork/{TenantID}/Policies/RequireSecurityDevice",
      "value": true,
      "odataType": "#microsoft.graph.omaSettingBoolean"
    },
    {
      "displayName": "SpecialCharacters",
      "description": null,
      "omaUri": "./User/Vendor/MSFT/PassportForWork/{TenantID}/Policies/PINComplexity/SpecialCharacters",
      "value": 2,
      "odataType": "#microsoft.graph.omaSettingInteger"
    },
    {
      "displayName": "UppercaseLetters",
      "description": null,
      "omaUri": "./User/Vendor/MSFT/PassportForWork/{TenantID}/Policies/PINComplexity/UppercaseLetters",
      "value": 2,
      "odataType": "#microsoft.graph.omaSettingInteger"
    },
    {
      "displayName": "LowercaseLetters",
      "description": null,
      "omaUri": "./User/Vendor/MSFT/PassportForWork/{TenantID}/Policies/PINComplexity/LowercaseLetters",
      "value": 2,
      "odataType": "#microsoft.graph.omaSettingInteger"
    }
  ]
}
