{
  "displayName": "Login - Self-service password reset",
  "description": "",
  "omaSettings": [
    {
      "displayName": "SSPR",
      "description": null,
      "omaUri": "./Device/Vendor/MSFT/Policy/Config/Authentication/AllowAadPasswordReset",
      "value": 1,
      "odataType": "#microsoft.graph.omaSettingInteger"
    }
  ]
}
