{
  "locale": "os-default",
  "enableWhiteGlove": false,
  "description": "",
  "outOfBoxExperienceSettings": {
    "userType": "standard",
    "hidePrivacySettings": true,
    "hideEULA": true,
    "skipKeyboardSelectionPage": true,
    "deviceUsageType": "singleUser",
    "hideEscapeLink": true
  },
  "extractHardwareHash": true,
  "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
  "lastModifiedDateTime": "2025-04-19T09:03:16.5867211Z",
  "createdDateTime": "2025-02-19T09:53:44.2537219Z",
  "displayName": "Workstations",
  "id": "1cc79e0f-6d68-4086-a736-3b97451440f8",
  "deviceNameTemplate": "WS-%SERIAL%",
  "hardwareHashExtractionEnabled": true,
  "outOfBoxExperienceSetting": {
    "privacySettingsHidden": true,
    "escapeLinkHidden": true,
    "userType": "standard",
    "keyboardSelectionPageSkipped": true,
    "eulaHidden": true,
    "deviceUsageType": "singleUser"
  },
  "managementServiceAppId": null,
  "enrollmentStatusScreenSettings": null,
  "deviceType": "windowsPc",
  "roleScopeTagIds": [
    "0"
  ],
  "language": "os-default",
  "preprovisioningAllowed": false
}
