{
  "displayName": "104 - Baseline - Block - Device platforms",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "platforms": {
      "excludePlatforms": [],
      "includePlatforms": [
        "windowsPhone",
        "linux"
      ]
    },
    "applications": {
      "includeUserActions": [],
      "excludeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "includeUsers": [
        "All"
      ],
      "excludeGroups": [],
      "excludeRoles": [],
      "includeGroups": [],
      "includeRoles": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ],
    "termsOfUse": [],
    "customAuthenticationFactors": []
  },
  "sessionControls": null
}
