{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-20T12:35:38.1859747Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-07-20T12:35:38.1859747Z","name":"Application - Microsoft Edge - Bookmarks","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"0979c2ab-46bb-42a9-aff3-6d2658adb36c","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedfavorites","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedfavorites_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedfavorites_managedfavorites","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":" [ { \"toplevel_name\": \"Company\" }, { \"url\": \"https://www.office.com/\", \"name\": \"Microsoft 365\" }, { \"url\": \"https://security.microsoft.com/quarantine\", \"name\": \"E-Mail Quarantine\" } ]"}}]}}}]}