{
  "description": "",
  "technologies": "mdm",
  "platforms": "windows10",
  "displayName": "BitLocker - Workstations",
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
        }
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
        }
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
        }
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
        }
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a5673a18-196d-49a0-a460-a8f35b807b45"
        }
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "041be1b9-62b2-478b-bb0c-fc3f712aa750",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "0b4775b0-8f27-4d40-b68d-b4e521d91230"
        }
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenhancedpin",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesenhancedpin_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "9e261c1d-9eb0-4edb-a9cf-d86390683954",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "1eb5feff-b03f-44ab-a5ce-198de8e4741e"
        }
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
        }
      },
      "id": "7"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
        }
      },
      "id": "8"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
        }
      },
      "id": "9"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1",
                "children": [
                  {
                    "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                      "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                      "children": [
                        {
                          "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                          "choiceSettingValue": {
                            "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_1",
                            "children": [],
                            "settingValueTemplateReference": {
                              "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                              "useTemplateDefault": false
                            }
                          },
                          "settingInstanceTemplateReference": null
                        }
                      ],
                      "settingValueTemplateReference": {
                        "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                        "useTemplateDefault": false
                      }
                    },
                    "settingInstanceTemplateReference": null
                  }
                ],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            },
            {
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "choiceSettingValue": {
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
                  "useTemplateDefault": false
                }
              },
              "settingInstanceTemplateReference": null
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "3a3ef51b-01c4-4f3b-9e63-5e41d351428b",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5f8b6127-bc7f-469b-b903-ea3d46035448"
        }
      },
      "id": "10"
    }
  ],
  "id": "5ccf25fe-8d4e-4c7b-904e-f1939a9f09a1"
}
