{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-25T07:24:14.38527Z",
  "creationSource": null,
  "description": "4.10.40.5.1 (L2) Ensure 'Microsoft Support Diagnostic Tool: Turn on MSDT interactive communication with support provider' is set to 'Disabled'\n4.10.20.1.3 (L2) Ensure 'Turn off Help Experience Improvement Program (User)' is set to 'Enabled'",
  "lastModifiedDateTime": "2025-10-25T16:50:18.3436366Z",
  "name": "🔴 – 🚀 Experience – Diagnostics",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies": "mdm",
  "id": "de29b9f6-7249-45ee-a55b-caef8af4342a",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "user_vendor_msft_policy_config_admx_helpandsupport_hpimplicitfeedback_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "user_vendor_msft_policy_config_admx_helpandsupport_hpimplicitfeedback",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_msdt_msdtsupportprovider_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_msdt_msdtsupportprovider",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    }
  ]
}
