{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-02-23T18:53:18.5640617Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-06-02T07:46:31.173419Z","name":"LAPS - admin.laps","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":6,"technologies":"mdm","id":"363f8cf2-58a8-4619-a5d9-591353a0746a","templateReference":{"templateId":"adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1","templateFamily":"endpointSecurityAccountProtection","templateDisplayName":"Local admin password solution (Windows LAPS)","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_backupdirectory","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a3270f64-e493-499d-8900-90290f61ed8a"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_backupdirectory_1","settingValueTemplateReference":{"settingValueTemplateId":"4d90f03d-e14c-43c4-86da-681da96a2f92","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passwordagedays_aad","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":30,"settingValueTemplateReference":{"settingValueTemplateId":"4d90f03d-e14c-43c4-86da-681da96a2f92","useTemplateDefault":false}}}]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_administratoraccountname","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d3d7d492-0019-4f56-96f8-1967f7deabeb"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","value":"admin.laps","settingValueTemplateReference":{"settingValueTemplateId":"992c7fce-f9e4-46ab-ac11-e167398859ea","useTemplateDefault":false}}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passwordcomplexity","settingInstanceTemplateReference":{"settingInstanceTemplateId":"8a7459e8-1d1c-458a-8906-7b27d216de52"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_passwordcomplexity_5","settingValueTemplateReference":{"settingValueTemplateId":"aa883ab5-625e-4e3b-b830-a37a4bb8ce01","useTemplateDefault":false},"children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_passwordlength","settingInstanceTemplateReference":{"settingInstanceTemplateId":"da7a1dbd-caf7-4341-ab63-ece6f994ff02"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":16,"settingValueTemplateReference":{"settingValueTemplateId":"d08f1266-5345-4f53-8ae1-4c20e6cb5ec9","useTemplateDefault":false}}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_postauthenticationactions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d9282eb1-d187-42ae-b366-7081f32dcfff"},"choiceSettingValue":{"value":"device_vendor_msft_laps_policies_postauthenticationactions_3","settingValueTemplateReference":{"settingValueTemplateId":"68ff4f78-baa8-4b32-bf3d-5ad5566d8142","useTemplateDefault":false},"children":[]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_laps_policies_postauthenticationresetdelay","settingInstanceTemplateReference":{"settingInstanceTemplateId":"a9e21166-4055-4042-9372-efaf3ef41868"},"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","value":2,"settingValueTemplateReference":{"settingValueTemplateId":"0deb6aee-8dac-40c4-a9dd-c3718e5c1d52","useTemplateDefault":false}}}}]}