{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-02-23T18:54:30.5707463Z","creationSource":null,"description":"Adds the local user account \"admin.laps\" into the Local Group \"Administrators\"","lastModifiedDateTime":"2025-05-04T15:12:02.2671426Z","name":"Local Group - Administrators","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"5dde40aa-25e9-4f32-934a-c131a2f20a54","templateReference":{"templateId":"22968f54-45fa-486c-848e-f8224aa69772_1","templateFamily":"endpointSecurityAccountProtection","templateDisplayName":"Local user group membership","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure","settingInstanceTemplateReference":{"settingInstanceTemplateId":"de06bec1-4852-48a0-9799-cf7b85992d45"},"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc","settingInstanceTemplateReference":null,"choiceSettingCollectionValue":[{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc_administrators","children":[]}]},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action_add_update","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype_manual","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_users","settingInstanceTemplateReference":null,"simpleSettingCollectionValue":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"admin.laps"}]}]}}]}]}]}]}}]}