{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T07:44:22.2956552Z",
  "creationSource": null,
  "description": "26.1 (L1) Ensure 'Device Password Enabled' is set to 'Enabled'\n26.2 (L1) Ensure 'Device Password Enabled: Alphanumeric Device Password Required' is set to 'Password or Alphanumeric PIN required'\n26.3 (L1) Ensure 'Device Password Enabled: Min Device Password Complex Characters' is set to 'Digits and lowercase letters are required'\n26.4 (L1) Ensure 'Device Password Enabled: Device Password Expiration' is set to '365 or fewer days, but not 0'\n26.5 (L1) Ensure 'Device Password Enabled: Device Password History' is set to '24 or more password(s)'\n26.6 (L1) Ensure 'Device Password Enabled: Max Device Password Failed Attempts' is set to '5 or fewer failed attempt(s), but not 0'\n26.7 (L1) Ensure 'Device Password Enabled: Max Inactivity Time Device Lock' is set to '15 or fewer minutes, but not 0'\n26.8 (L1) Ensure 'Device Password Enabled: Min Device Password Length' is set to '14 or more character(s)'\n26.9 (L1) Ensure 'Minimum Password Age' is set to '1 or more day(s)' ",
  "lastModifiedDateTime": "2025-10-25T16:28:19.7507457Z",
  "name": "🔴 – 💼 Local Identities – Password",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies": "mdm",
  "id": "4d1ae248-9542-4320-a129-e1233ea947fc",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled_0",
          "settingValueTemplateReference": null,
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword_1",
                "settingValueTemplateReference": null,
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_allowsimpledevicepassword",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired_0",
                "settingValueTemplateReference": null,
                "children": [
                  {
                    "choiceSettingValue": {
                      "value": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters_2",
                      "settingValueTemplateReference": null,
                      "children": []
                    },
                    "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordcomplexcharacters",
                    "settingInstanceTemplateReference": null,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                  }
                ]
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_alphanumericdevicepasswordrequired",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordexpiration",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": 365,
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
              }
            },
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordhistory",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": 24,
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
              }
            },
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_maxdevicepasswordfailedattempts",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": 5,
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
              }
            },
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_maxinactivitytimedevicelock",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": 10,
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
              }
            },
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_mindevicepasswordlength",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": 14,
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
              }
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_devicepasswordenabled",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_devicelock_minimumpasswordage",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "simpleSettingValue": {
          "value": 1,
          "settingValueTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
        }
      },
      "id": "1"
    }
  ]
}
