{
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure",
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup",
                "groupSettingCollectionValue": [
                  {
                    "children": [
                      {
                        "choiceSettingCollectionValue": [
                          {
                            "settingValueTemplateReference": null,
                            "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc_administrators",
                            "children": []
                          }
                        ],
                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc",
                        "settingInstanceTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance"
                      },
                      {
                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action",
                        "choiceSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action_add_update",
                          "children": []
                        },
                        "settingInstanceTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                      },
                      {
                        "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype",
                        "choiceSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype_manual",
                          "children": [
                            {
                              "settingDefinitionId": "device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_users",
                              "settingInstanceTemplateReference": null,
                              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                              "simpleSettingCollectionValue": [
                                {
                                  "settingValueTemplateReference": null,
                                  "value": "admin.laps",
                                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                                }
                              ]
                            }
                          ]
                        },
                        "settingInstanceTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                      }
                    ],
                    "settingValueTemplateReference": null
                  }
                ],
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "de06bec1-4852-48a0-9799-cf7b85992d45"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance"
      },
      "id": "0"
    }
  ],
  "description": "Adds the local user account \"admin.laps\" into the Local Group \"Administrators\"",
  "id": "5dde40aa-25e9-4f32-934a-c131a2f20a54",
  "displayName": "Local Group - Administrators",
  "technologies": "mdm",
  "platforms": "windows10"
}
