{
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_windowslogon_enablefirstlogonanimation",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_windowslogon_enablefirstlogonanimation_0",
          "children": []
        },
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ],
  "description": "",
  "id": "6dfb49f7-653d-4feb-9307-3b3dd23cff27",
  "displayName": "Login - First Logon Animation",
  "technologies": "mdm",
  "platforms": "windows10"
}
