{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-04-04T06:10:44.5941005Z","creationSource":null,"description":"","lastModifiedDateTime":"2025-04-04T06:10:44.5941005Z","name":"Login - First Logon Animation","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"65aa1b2b-7bf7-49e3-9d3e-cd9bf515d82f","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_windowslogon_enablefirstlogonanimation","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_windowslogon_enablefirstlogonanimation_0","children":[]}}}]}