{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-07-25T13:32:52.00032Z",
  "creationSource": null,
  "description": "1.8.1 (L1) Ensure 'Blocks external extensions from being installed' is set to 'Enabled'\n1.8.2 (L2) Ensure 'Configure extension management settings' is set to 'Enabled: *'\n",
  "lastModifiedDateTime": "2025-10-25T16:24:37.8625947Z",
  "name": "🔴 – 🌍 Microsoft Edge – Extensions",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 3,
  "technologies": "mdm",
  "id": "d44acbda-8691-49ba-bf78-704fc150ea44",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallallowlist_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallallowlist_extensioninstallallowlistdesc",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
              "simpleSettingCollectionValue": [
                {
                  "value": "dbclpoekepcmadpkeaelmhiheolhjflj",
                  "settingValueTemplateReference": null,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                },
                {
                  "value": "ejeeoonlleiljffabooidiebffmlmigi",
                  "settingValueTemplateReference": null,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                }
              ]
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallallowlist",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallforcelist_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallforcelist",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
              "simpleSettingCollectionValue": [
                {
                  "value": "*",
                  "settingValueTemplateReference": null,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                }
              ]
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "2"
    }
  ]
}
