{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-10-25T12:57:15.6893079Z","creationSource":null,"description":"22.24 (L2) Ensure 'Enable Convert Warn To Block' is set to 'Warn\nverdicts are converted to block'","lastModifiedDateTime":"2025-11-02T10:08:34.3134698Z","name":"🔴 – 🛡️ Microsoft Defender – Network Protection","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"da5a15b2-b6ef-4b68-861c-84e1a1beb4bf","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_enableconvertwarntoblock","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_defender_configuration_enableconvertwarntoblock_1","children":[]}}}]}