{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-10-25T09:14:22.3276258Z","creationSource":null,"description":"🔴  4.11.28.3.2 (L2) Ensure 'Join Microsoft MAPS' is set to 'Disabled'","lastModifiedDateTime":"2025-11-02T13:47:41.1291805Z","name":"🔴 – 🛡️ Microsoft Defender – MAPS","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"dfd23157-c37a-4d80-882c-59dcb60346a0","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_spynetreporting","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_spynetreporting_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_spynetreporting_spynetreporting","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_spynetreporting_spynetreporting_2","children":[]}}]}}}]}