{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-10-25T13:04:09.742946Z","creationSource":null,"description":"22.27 (L1) Ensure 'Hide Exclusions From Local Users' is set to 'Enabled'\n22.28 (L1) Ensure 'Oobe Enable Rtp And Sig Update' is set to 'Enabled' \n96.1 (L1) Ensure 'Disallow Exploit Protection Override' is set to '(Enable)'","lastModifiedDateTime":"2025-11-02T10:08:48.1625116Z","name":"🔴 – 🛡️ Microsoft Defender – Integrity","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":4,"technologies":"mdm","id":"afd0f6f5-7515-455c-b873-da954c9ef2be","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins_1","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers_1","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_oobeenablertpandsigupdate","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_defender_configuration_oobeenablertpandsigupdate_1","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_windowsdefendersecuritycenter_disallowexploitprotectionoverride","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_windowsdefendersecuritycenter_disallowexploitprotectionoverride_1","children":[]}}}]}