{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-10-19T16:49:38.1246658Z","creationSource":null,"description":"22.23 (L1) Ensure 'Days Until Aggressive Catchup Quick Scan' is set to '7 days' or fewer\n22.25 (L2) Ensure 'Enable File Hash Computation' is set to 'Enable'\n22.30 (L1) Ensure 'Quick Scan Include Exclusions' is set to '1'","lastModifiedDateTime":"2025-11-02T10:03:10.9301499Z","name":"🔴 – 🛡️ Microsoft Defender – Scan","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":6,"technologies":"mdm","id":"078fa123-9f22-42cd-bbfb-99e2cfa14fac","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_realtimeprotection_disablescanonrealtimeenable","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_realtimeprotection_disablescanonrealtimeenable_1","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_scan_disablepackedexescanning","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_scan_disablepackedexescanning_1","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableroutinelytakingaction","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_microsoftdefenderantivirus_disableroutinelytakingaction_0","children":[]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_daysuntilaggressivecatchupquickscan","settingInstanceTemplateReference":null,"auditRuleInformation":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":7}}},{"id":"4","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_enablefilehashcomputation","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_defender_configuration_enablefilehashcomputation_1","children":[]}}},{"id":"5","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_defender_configuration_quickscanincludeexclusions","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_defender_configuration_quickscanincludeexclusions_1","children":[]}}}]}