{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-25T13:04:09.742946Z",
  "creationSource": null,
  "description": "22.27 (L1) Ensure 'Hide Exclusions From Local Users' is set to 'Enabled'\n22.28 (L1) Ensure 'Oobe Enable Rtp And Sig Update' is set to 'Enabled' ",
  "lastModifiedDateTime": "2025-10-25T16:51:46.4341194Z",
  "name": "🔴 – 🛡️ Microsoft Defender – Security Integrity",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies": "mdm",
  "id": "afd0f6f5-7515-455c-b873-da954c9ef2be",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_defender_configuration_oobeenablertpandsigupdate_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_defender_configuration_oobeenablertpandsigupdate",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    }
  ]
}
