{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-07-25T13:32:51.8596953Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2025-10-25T16:24:20.0063159Z",
  "name": "🔴 – 🌍 Microsoft Edge – Bookmarks",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "f1d7e3f1-123f-4028-bf61-f0bbd0d183fc",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedfavorites_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "settingDefinitionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedfavorites_managedfavorites",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "value": " [ { \"toplevel_name\": \"Company\" }, { \"url\": \"https://www.office.com/\", \"name\": \"Microsoft 365\" }, { \"url\": \"https://security.microsoft.com/quarantine\", \"name\": \"E-Mail Quarantine\" } ]",
                "settingValueTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
              }
            }
          ]
        },
        "settingDefinitionId": "user_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_managedfavorites",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ]
}
