{
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_privacy_allowinputpersonalization",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_privacy_allowinputpersonalization_0",
          "children": []
        },
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ],
  "description": "",
  "id": "448392c5-4c4f-442d-a756-5c332b554ae3",
  "displayName": "Privacy - Speech",
  "technologies": "mdm",
  "platforms": "windows10"
}
