{
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_privacy_disableadvertisingid",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_privacy_disableadvertisingid_1",
          "children": []
        },
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ],
  "description": "",
  "id": "67844564-7a08-4cd9-94bd-600b979cf488",
  "displayName": "Privacy - Advertising ID",
  "technologies": "mdm",
  "platforms": "windows10"
}
