{
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_credssp_restrictedremoteadministration",
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_admx_credssp_restrictedremoteadministration_1",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_admx_credssp_restrictedremoteadministration_restrictedremoteadministrationdrop",
              "choiceSettingValue": {
                "settingValueTemplateReference": null,
                "value": "device_vendor_msft_policy_config_admx_credssp_restrictedremoteadministration_restrictedremoteadministrationdrop_2",
                "children": []
              },
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ],
  "description": "",
  "id": "7507c7ff-63a3-45bd-9159-e649f8dc65fa",
  "displayName": "Remote-Desktop - Credential Guard",
  "technologies": "mdm",
  "platforms": "windows10"
}
