{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-09-28T10:11:10.1739503Z",
  "creationSource": null,
  "description": "4.11.36.3.2 (L1) Ensure 'Do not allow passwords to be saved' is set to 'Enabled'\n4.11.36.4.3.2 (L1) Ensure 'Do not allow drive redirection' is set to 'Enabled'\n4.11.36.4.9.1 (L1) Ensure 'Always prompt for password upon connection' is set to 'Enabled'\n4.11.36.4.9.2 (L1) Ensure 'Require secure RPC communication' is set to 'Enabled'\n4.11.36.4.9.3 (L1) Ensure 'Require use of specific security layer for remote (RDP) connections' is set to 'Enabled: SSL'\n4.11.36.4.9.4 (L1) Ensure 'Require user authentication for remote connections by using Network Level Authentication' is set to 'Enabled'\n4.11.36.4.9.5 (L1) Ensure 'Set client connection encryption level' is set to 'Enabled: High Level'\n4.11.36.4.11.1 (L1) Ensure 'Do not delete temp folders upon exit' is set to 'Disabled'\n",
  "lastModifiedDateTime": "2025-10-25T16:47:44.2864525Z",
  "name": "🔴 – 🖥️ Remote Desktop Services – Basic",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 8,
  "technologies": "mdm",
  "id": "7484b9fe-f5b2-472c-967b-515e64ca16cc",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_remotedesktopservices_donotallowpasswordsaving_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_donotallowpasswordsaving",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_remotedesktopservices_donotallowdriveredirection_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_donotallowdriveredirection",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_remotedesktopservices_promptforpassworduponconnection_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_promptforpassworduponconnection",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_remotedesktopservices_requiresecurerpccommunication_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_requiresecurerpccommunication",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_terminalserver_ts_security_layer_policy_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_policy_config_admx_terminalserver_ts_security_layer_policy_ts_security_layer_2",
                "settingValueTemplateReference": null,
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_security_layer_policy_ts_security_layer",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_security_layer_policy",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_authentication_policy_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_user_authentication_policy",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_remotedesktopservices_clientconnectionencryptionlevel_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_policy_config_remotedesktopservices_clientconnectionencryptionlevel_ts_encryption_level_3",
                "settingValueTemplateReference": null,
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_clientconnectionencryptionlevel_ts_encryption_level",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_remotedesktopservices_clientconnectionencryptionlevel",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_terminalserver_ts_temp_delete_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_terminalserver_ts_temp_delete",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "7"
    }
  ]
}
