{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T11:19:27.4157165Z",
  "creationSource": null,
  "description": "4.11.8.1 (L1) Ensure 'Do not display the password reveal button' is set to 'Enabled'\n4.11.8.2 (L1) Ensure 'Enumerate administrator accounts on elevation' is set to 'Disabled'\n4.11.8.3 (L1) Ensure 'Prevent the use of security questions for local accounts' is set to 'Enabled'",
  "lastModifiedDateTime": "2025-10-25T16:41:16.9190636Z",
  "name": "🔴 – 🔒 Security – Credential User Interface",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 3,
  "technologies": "mdm",
  "id": "a541f082-d91d-4ed2-b129-804b30307781",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_credentialsui_disablepasswordreveal_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_credentialsui_disablepasswordreveal",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_credentialsui_enumerateadministrators_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_credentialsui_enumerateadministrators",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_credui_nolocalpasswordresetquestions_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_credui_nolocalpasswordresetquestions",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "2"
    }
  ]
}
