{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T13:35:03.8652176Z",
  "creationSource": null,
  "description": "96.1 (L1) Ensure 'Disallow Exploit Protection Override' is set to '(Enable)'",
  "lastModifiedDateTime": "2025-10-25T16:42:40.981435Z",
  "name": "🔴 – 🔒 Security – Exploit Protection",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "d6955127-be98-46df-9c57-212e8226b9b0",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disallowexploitprotectionoverride_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsdefendersecuritycenter_disallowexploitprotectionoverride",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ]
}
