{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T13:40:56.4609367Z",
  "creationSource": null,
  "description": "4.11.31.1 (L1) Ensure 'Prevent users from sharing files within their profile. (User)' is set to 'Enabled'",
  "lastModifiedDateTime": "2025-10-25T16:44:34.7188619Z",
  "name": "🔴 – 🔒 Security – Network Sharing",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "73a76390-15e5-455d-ba0d-a60e1e3ef8ed",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "user_vendor_msft_policy_config_admx_sharing_noinplacesharing_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "user_vendor_msft_policy_config_admx_sharing_noinplacesharing",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    }
  ]
}
