{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T09:52:51.6615931Z",
  "creationSource": null,
  "description": "4.6.4.1 (L1) Ensure 'Turn off multicast name resolution' is set to 'Enabled' \n4.6.9.1 (L1) Ensure 'Prohibit installation and configuration of Network Bridge on your DNS domain network' is set to 'Enabled'\n4.6.9.2 (L1) Ensure 'Prohibit use of Internet Connection Sharing on your DNS domain network' is set to 'Enabled'\n4.6.9.3 (L1) Ensure 'Require domain users to elevate when setting a network's location' is set to 'Enabled'\n4.6.11.1 (L1) Ensure 'Hardened UNC Paths' is set to 'Enabled, with \"Require Mutual Authentication\", \"Require Integrity\", and “Require Privacy” set for all NETLOGON and SYSVOL shares'\n4.6.18.1 (L1) Ensure 'Minimize the number of simultaneous connections to the Internet or a Windows Domain' is set to 'Enabled: 3 = Prevent Wi-Fi when on Ethernet'\n4.6.18.2 (L1) Ensure 'Prohibit connection to non-domain networks when connected to domain authenticated network' is set to 'Enabled'",
  "lastModifiedDateTime": "2025-10-25T16:42:32.4051018Z",
  "name": "🔴 – 🔒 Security – Domain Connectivity",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 7,
  "technologies": "mdm",
  "id": "aa5e541e-648b-49ee-8e90-707b6b12ed68",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_dnsclient_turn_off_multicast",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_prohibitinstallationandconfigurationofnetworkbridge",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_showsharedaccessui",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_networkconnections_nc_stddomainusersetlocation",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
              "groupSettingCollectionValue": [
                {
                  "settingValueTemplateReference": null,
                  "children": [
                    {
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                      "settingInstanceTemplateReference": null,
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "value": "\\\\*\\NETLOGON",
                        "settingValueTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                      }
                    },
                    {
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                      "settingInstanceTemplateReference": null,
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "value": "RequireMutualAuthentication=1,RequireIntegrity=1",
                        "settingValueTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                      }
                    }
                  ]
                },
                {
                  "settingValueTemplateReference": null,
                  "children": [
                    {
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_key",
                      "settingInstanceTemplateReference": null,
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "value": "\\\\*\\SYSVOL",
                        "settingValueTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                      }
                    },
                    {
                      "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths_pol_hardenedpaths_value",
                      "settingInstanceTemplateReference": null,
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                      "simpleSettingValue": {
                        "value": "RequireMutualAuthentication=1,RequireIntegrity=1",
                        "settingValueTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                      }
                    }
                  ]
                }
              ]
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_connectivity_hardeneduncpaths",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_1",
          "settingValueTemplateReference": null,
          "children": [
            {
              "choiceSettingValue": {
                "value": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options_3",
                "settingValueTemplateReference": null,
                "children": []
              },
              "settingDefinitionId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections_wcm_minimizeconnections_options",
              "settingInstanceTemplateReference": null,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            }
          ]
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_wcm_wcm_minimizeconnections",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_windowsconnectionmanager_prohitconnectiontonondomainnetworkswhenconnectedtodomainauthenticatednetwork",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "6"
    }
  ]
}
