{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-20T11:05:30.977757Z","creationSource":null,"description":"Security Baseline for Windows 10 and later\nVersion 24H2\nOriginal","lastModifiedDateTime":"2025-07-20T11:35:34.6790648Z","name":"Security Baseline - Local Security Authority","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"99774c10-0b3d-48f3-b173-b3aecb5a7bcd","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localsecurityauthority_configurelsaprotectedprocess","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localsecurityauthority_configurelsaprotectedprocess_1","children":[]}}}]}