{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-20T11:05:32.1478335Z","creationSource":null,"description":"Security Baseline for Windows 10 and later\nVersion 24H2\nOriginal","lastModifiedDateTime":"2025-07-20T11:35:13.755531Z","name":"Security Baseline - Search","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"ce45988d-2fe3-41ba-b211-a772b366baa8","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_search_allowindexingencryptedstoresoritems","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_search_allowindexingencryptedstoresoritems_0","children":[]}}}]}