{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T11:15:43.9327706Z",
  "creationSource": null,
  "description": "CIS L1 -> 89.x User Rights\n89.24 (L2) Ensure 'Log On As Batch Job' is set to 'Administrators'",
  "lastModifiedDateTime": "2025-10-25T16:46:16.2034879Z",
  "name": "🔴 – 🔒 Security – User Rights",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 27,
  "technologies": "mdm",
  "id": "96de5c00-7d82-456c-a751-554ccf9eabf5",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_accessfromnetwork",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-32-555",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_allowlocallogon",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-32-545",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_backupfilesanddirectories",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_changesystemtime",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-19",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_createglobalobjects",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-19",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-20",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-6",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "4"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_createpagefile",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "5"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_createsymboliclinks",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-83-0",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "6"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_debugprograms",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "7"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_denyaccessfromnetwork",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-113",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-32-546",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "8"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_denylocallogon",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-546",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "9"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_denylogonasservice",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-546",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "10"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_denyremotedesktopserviceslogon",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-113",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-32-546",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "11"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_generatesecurityaudits",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-19",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-20",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "12"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_impersonateclient",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-6",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-19",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-20",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "13"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_increaseschedulingpriority",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-90-0",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "14"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_loadunloaddevicedrivers",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "15"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_logonasbatchjob",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "16"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_manageauditingandsecuritylog",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "17"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_managevolume",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "18"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_modifyfirmwareenvironment",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "19"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_profilesingleprocess",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "20"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_profilesystemperformance",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-80",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "21"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_remoteshutdown",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "22"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_replaceprocessleveltoken",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-19",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          },
          {
            "value": "*S-1-5-20",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "23"
    },
    {
      "settingInstance": {
        "settingDefinitionId": "device_vendor_msft_policy_config_userrights_restorefilesanddirectories",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
        "simpleSettingCollectionValue": [
          {
            "value": "*S-1-5-32-544",
            "settingValueTemplateReference": null,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        ]
      },
      "id": "24"
    }
  ]
}
