{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-20T11:05:35.132655Z","creationSource":null,"description":"Security Baseline for Windows 10 and later\nVersion 24H2\nOriginal","lastModifiedDateTime":"2025-07-20T11:38:08.2221952Z","name":"Security Baseline - Windows Ink Workspace","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"c0fa7929-7f06-4969-8766-aa0673f510d1","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_windowsinkworkspace_allowwindowsinkworkspace_2","children":[]}}}]}