{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-10-19T10:15:18.4415094Z",
  "creationSource": null,
  "description": "4.10.29.5.1 (L1) Ensure 'Require a password when a computer wakes (on battery)' is set to 'Enabled' \n4.10.29.5.2 (L1) Ensure 'Require a password when a computer wakes (plugged in)' is set to 'Enabled'",
  "lastModifiedDateTime": "2025-10-25T16:23:07.8671082Z",
  "name": "🔴 – ⚙️ System – Power Management",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 5,
  "technologies": "mdm",
  "id": "721ed2c1-1a40-4d60-b9d2-1504f5cc506f",
  "templateReference": {
    "templateFamily": "none",
    "templateDisplayVersion": null,
    "templateDisplayName": null,
    "templateId": ""
  },
  "settings": [
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_power_allowstandbystateswhensleepingonbattery_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_power_allowstandbystateswhensleepingonbattery",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_power_allowstandbywhensleepingpluggedin_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_power_allowstandbywhensleepingpluggedin",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakesonbattery_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakesonbattery",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakespluggedin_1",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_power_requirepasswordwhencomputerwakespluggedin",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "choiceSettingValue": {
          "value": "device_vendor_msft_policy_config_power_allowhibernate_0",
          "settingValueTemplateReference": null,
          "children": []
        },
        "settingDefinitionId": "device_vendor_msft_policy_config_power_allowhibernate",
        "settingInstanceTemplateReference": null,
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
      },
      "id": "4"
    }
  ]
}
