{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-10-19T10:29:30.6834118Z","creationSource":null,"description":"4.10.30.1 (L1) Ensure 'Configure Offer Remote Assistance' is set to 'Disabled'\n4.10.30.2 (L1) Ensure 'Configure Solicited Remote Assistance' is set to 'Disabled'","lastModifiedDateTime":"2025-11-02T10:32:21.5137255Z","name":"🔴 – ⚙️ System – Remote Assistance","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm","id":"f5610723-6d9b-4241-9efa-2c182e2ccd49","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_remoteassistance_unsolicitedremoteassistance","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_remoteassistance_unsolicitedremoteassistance_0","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_remoteassistance_solicitedremoteassistance","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_remoteassistance_solicitedremoteassistance_0","children":[]}}}]}