{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2026-01-15T15:58:35.1630388Z","creationSource":null,"description":"","lastModifiedDateTime":"2026-01-15T15:58:57.4758223Z","name":"🔴 – 🔑 Windows Hello for Business – Security Key","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"25f3739d-beff-4750-bc4d-f76f24fb5774","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_passportforwork_securitykey_usesecuritykeyforsignin","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_passportforwork_securitykey_usesecuritykeyforsignin_1","children":[]}}}]}