{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-10-19T15:07:54.058278Z","creationSource":null,"description":"4.11.42.1 (L1) Ensure 'Turn off the offer to update to the latest version of Windows' is set to 'Enabled'\n23.1 (L1) Ensure 'DO Download Mode' is NOT set to 'HTTP blended with Internet Peering'","lastModifiedDateTime":"2025-11-03T08:47:39.9037572Z","name":"🔴 – 🛠️ Windows Updates","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":2,"technologies":"mdm","id":"1b04e0a6-e6ca-46fd-bef5-3389cf159158","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_admx_windowsstore_disableosupgrade_2","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_admx_windowsstore_disableosupgrade_2_1","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_deliveryoptimization_dodownloadmode","settingInstanceTemplateReference":null,"auditRuleInformation":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_deliveryoptimization_dodownloadmode_1","children":[]}}}]}