{
  "displayName": "401 - Service Accounts - Block - Access from untrusted locations",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "applications": {
      "includeUserActions": [],
      "excludeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": [
        "All"
      ]
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "includeUsers": [],
      "excludeGroups": [],
      "excludeRoles": [],
      "includeGroups": [
        "<ServiceAccountsGroup>"
      ],
      "includeRoles": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ],
    "termsOfUse": [],
    "customAuthenticationFactors": []
  },
  "sessionControls": null
}
