{
  "displayName": "105 - Baseline - Require - Trusted location to register security information",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "clientAppTypes": [
      "all"
    ],
    "locations": {
      "excludeLocations": [
        "AllTrusted"
      ],
      "includeLocations": [
        "All"
      ]
    },
    "applications": {
      "includeUserActions": [
        "urn:user:registersecurityinfo"
      ],
      "excludeApplications": [],
      "includeAuthenticationContextClassReferences": [],
      "includeApplications": []
    },
    "signInRiskLevels": [],
    "userRiskLevels": [],
    "users": {
      "excludeUsers": [
        "<EmergencyAccessAccount>"
      ],
      "includeUsers": [
        "All"
      ],
      "excludeGroups": [],
      "excludeRoles": [],
      "includeGroups": [],
      "includeRoles": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ],
    "termsOfUse": [],
    "customAuthenticationFactors": []
  },
  "sessionControls": null
}
