{
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('cccaa846-ffab-45e3-afb0-60039ed54c8f')/grantControls/authenticationStrength/$entity",
    "customAuthenticationFactors": [],
    "authenticationStrength": {
      "requirementsSatisfied": "mfa",
      "description": "Combinations of methods that satisfy strong authentication, such as a password + SMS",
      "allowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "x509CertificateMultiFactor",
        "deviceBasedPush",
        "temporaryAccessPassOneTime",
        "temporaryAccessPassMultiUse",
        "password,microsoftAuthenticatorPush",
        "password,softwareOath",
        "password,hardwareOath",
        "password,sms",
        "password,voice",
        "federatedMultiFactor",
        "microsoftAuthenticatorPush,federatedSingleFactor",
        "softwareOath,federatedSingleFactor",
        "hardwareOath,federatedSingleFactor",
        "sms,federatedSingleFactor",
        "voice,federatedSingleFactor"
      ],
      "combinationConfigurations": [],
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('cccaa846-ffab-45e3-afb0-60039ed54c8f')/grantControls/authenticationStrength/combinationConfigurations",
      "modifiedDateTime": "2021-12-01T08:00:00Z",
      "policyType": "builtIn",
      "displayName": "Multifactor authentication",
      "createdDateTime": "2021-12-01T08:00:00Z",
      "id": "00000000-0000-0000-0000-000000000002"
    },
    "builtInControls": [
      "passwordChange"
    ],
    "operator": "AND",
    "termsOfUse": []
  },
  "sessionControls": null,
  "deletedDateTime": null,
  "modifiedDateTime": "2025-03-08T08:12:13.0537308Z",
  "state": "enabledForReportingButNotEnforced",
  "templateId": null,
  "displayName": "201 - Grant - High Sign-in/User risk -> Require password change ",
  "conditions": {
    "users": {
      "includeGroups": [],
      "includeUsers": [
        "All"
      ],
      "includeGuestsOrExternalUsers": null,
      "excludeGroups": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": []
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": null,
    "applications": {
      "applicationFilter": null,
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": []
    },
    "times": null,
    "userRiskLevels": [
      "high"
    ],
    "devices": null,
    "signInRiskLevels": [],
    "locations": null,
    "platforms": null,
    "deviceStates": null
  },
  "partialEnablementStrategy": null,
  "createdDateTime": "2025-03-08T07:56:54.457129Z",
  "id": "cccaa846-ffab-45e3-afb0-60039ed54c8f"
}
