{
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('99d42e63-6396-43c0-b794-9e5fa47e817f')/grantControls/authenticationStrength/$entity",
    "customAuthenticationFactors": [],
    "authenticationStrength": {
      "requirementsSatisfied": "mfa",
      "description": "Combinations of methods that satisfy strong authentication, such as a password + SMS",
      "allowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "x509CertificateMultiFactor",
        "deviceBasedPush",
        "temporaryAccessPassOneTime",
        "temporaryAccessPassMultiUse",
        "password,microsoftAuthenticatorPush",
        "password,softwareOath",
        "password,hardwareOath",
        "password,sms",
        "password,voice",
        "federatedMultiFactor",
        "microsoftAuthenticatorPush,federatedSingleFactor",
        "softwareOath,federatedSingleFactor",
        "hardwareOath,federatedSingleFactor",
        "sms,federatedSingleFactor",
        "voice,federatedSingleFactor"
      ],
      "combinationConfigurations": [],
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('99d42e63-6396-43c0-b794-9e5fa47e817f')/grantControls/authenticationStrength/combinationConfigurations",
      "modifiedDateTime": "2021-12-01T08:00:00Z",
      "policyType": "builtIn",
      "displayName": "Multifactor authentication",
      "createdDateTime": "2021-12-01T08:00:00Z",
      "id": "00000000-0000-0000-0000-000000000002"
    },
    "builtInControls": [],
    "operator": "OR",
    "termsOfUse": []
  },
  "sessionControls": null,
  "deletedDateTime": null,
  "modifiedDateTime": "2025-03-09T10:54:37.8274276Z",
  "state": "enabledForReportingButNotEnforced",
  "templateId": null,
  "displayName": "202 - Grant - Medium/Low Sign-in/User risk -> Require MFA",
  "conditions": {
    "users": {
      "includeGroups": [],
      "includeUsers": [
        "All"
      ],
      "includeGuestsOrExternalUsers": null,
      "excludeGroups": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": []
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": null,
    "applications": {
      "applicationFilter": null,
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": []
    },
    "times": null,
    "userRiskLevels": [
      "medium",
      "low"
    ],
    "devices": null,
    "signInRiskLevels": [
      "medium",
      "low"
    ],
    "locations": null,
    "platforms": null,
    "deviceStates": null
  },
  "partialEnablementStrategy": null,
  "createdDateTime": "2025-03-08T07:58:23.5445219Z",
  "id": "99d42e63-6396-43c0-b794-9e5fa47e817f"
}
