{
  "grantControls": {
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('2fd2f784-8d7f-457f-838f-f7c7ab73e37f')/grantControls/authenticationStrength/$entity",
    "customAuthenticationFactors": [],
    "authenticationStrength": null,
    "builtInControls": [
      "compliantApplication"
    ],
    "operator": "OR",
    "termsOfUse": []
  },
  "sessionControls": null,
  "deletedDateTime": null,
  "modifiedDateTime": "2025-03-09T10:56:15.6289696Z",
  "state": "enabledForReportingButNotEnforced",
  "templateId": "6acdf4c3-6815-485c-a57d-2c349d517ba0",
  "displayName": "206 - Grant - Require app protection (Android/iOS)",
  "conditions": {
    "users": {
      "includeGroups": [],
      "includeUsers": [
        "All"
      ],
      "includeGuestsOrExternalUsers": null,
      "excludeGroups": [],
      "includeRoles": [],
      "excludeGuestsOrExternalUsers": null,
      "excludeUsers": [],
      "excludeRoles": []
    },
    "clientAppTypes": [
      "all"
    ],
    "clientApplications": null,
    "applications": {
      "applicationFilter": null,
      "includeAuthenticationContextClassReferences": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "excludeApplications": []
    },
    "platforms": {
      "excludePlatforms": [
        "windows",
        "windowsPhone",
        "macOS",
        "linux"
      ],
      "includePlatforms": [
        "android",
        "iOS"
      ]
    },
    "userRiskLevels": [],
    "devices": null,
    "signInRiskLevels": [],
    "locations": null,
    "times": null,
    "deviceStates": null
  },
  "partialEnablementStrategy": null,
  "createdDateTime": "2025-03-08T11:20:29.0777441Z",
  "id": "2fd2f784-8d7f-457f-838f-f7c7ab73e37f"
}
