{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T15:05:32.4963904Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.2.1.7 Ensure \"Allow documents from managed sources in unmanaged destinations\" is set to \"Disabled\" \n3.2.1.20 Ensure \"Allow documents from managed sources in\nunmanaged destinations\" is set to \"Disabled\"","lastModifiedDateTime":"2025-08-10T16:31:36.0050774Z","name":"All - CIS Level 1 - Allow Open From Managed To Unmanaged","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"92fdf191-6dc6-454d-ba30-85df1b6ffc74","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.applicationaccess_com.apple.applicationaccess","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.applicationaccess_allowopenfrommanagedtounmanaged","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.applicationaccess_allowopenfrommanagedtounmanaged_false","children":[]}}]}]}}]}