{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T14:53:01.6961128Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.2.1.1 Ensure \"Allow Siri while device is locked\" is set to \"Disabled\"","lastModifiedDateTime":"2025-08-10T15:56:02.8918361Z","name":"All - CIS Level 1 - Allow Assistant While Locked","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"97d3b675-21af-4446-a681-ca5b0eb850ef","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.applicationaccess_com.apple.applicationaccess","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.applicationaccess_allowassistantwhilelocked","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.applicationaccess_allowassistantwhilelocked_false","children":[]}}]}]}}]}