{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T15:06:48.9636373Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.2.1.8 Ensure \"Allow documents from unmanaged sources in managed destinations\" is set to \"Disabled\"\n3.2.1.21 Ensure \"Allow documents from unmanaged sources in\nmanaged destinations\" is set to \"Disabled\"","lastModifiedDateTime":"2025-08-10T16:32:05.5421328Z","name":"All - CIS Level 1 - Allow Open From Unmanaged To Managed","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"aae524f4-86e0-44c9-9e31-3fbaced2dd85","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.applicationaccess_com.apple.applicationaccess","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.applicationaccess_allowopenfromunmanagedtomanaged","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.applicationaccess_allowopenfromunmanagedtomanaged_false","children":[]}}]}]}}]}