{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T15:35:35.9671893Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.4.5 Ensure \"Maximum grace period for device lock\" is set to \"Immediately\"\n3.4.5 Ensure \"Maximum grace period for device lock\" is set to \"Immediately\"","lastModifiedDateTime":"2025-08-10T16:46:08.1483728Z","name":"All - CIS Level 1 - Max Grace Period","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"b2252b5e-2093-48a7-9d98-23a7e5c78030","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_maxgraceperiod","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":0}}]}]}}]}