{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T15:31:40.8544352Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.4.3 Ensure \"Minimum passcode length\" is set to a value of \"6\" or greater\n3.4.3 Ensure \"Minimum passcode length\" is set to a value of \"6\" or greater ","lastModifiedDateTime":"2025-08-10T16:45:01.1565113Z","name":"All - CIS Level 1 - Min Passcode Length ","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"b394e308-7a59-4147-a0e0-229bc3a3d588","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_com.apple.mobiledevice.passwordpolicy","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"com.apple.mobiledevice.passwordpolicy_minlength","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue","settingValueTemplateReference":null,"value":6}}]}]}}]}