{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T15:10:41.4587333Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.2.1.9 Ensure \"Treat AirDrop as unmanaged destination\" is set to \"Enabled\"\n3.2.1.22 Ensure \"Treat AirDrop as unmanaged destination\" is set to \"Enabled\"","lastModifiedDateTime":"2025-08-10T16:32:35.4938956Z","name":"All - CIS Level 1 - Force AirDrop Unmanaged","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"3ebd9001-fb71-41f1-9f5f-ae7c891f77dc","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.applicationaccess_com.apple.applicationaccess","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.applicationaccess_forceairdropunmanaged","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.applicationaccess_forceairdropunmanaged_true","children":[]}}]}]}}]}