{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T16:17:24.2901649Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n3.2.1.11 Ensure \"Allow Erase All Content and Settings\" is set to \"Disabled\"","lastModifiedDateTime":"2025-08-10T16:17:24.2901649Z","name":"Company - CIS Level 1 - Allow Erase Content And Settings","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"ae06c39d-69d8-4c14-b531-b3d94b737a74","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.applicationaccess_com.apple.applicationaccess","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.applicationaccess_allowerasecontentandsettings","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.applicationaccess_allowerasecontentandsettings_false","children":[]}}]}]}}]}