{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-08-10T15:15:56.9731165Z","creationSource":null,"description":"CIS Apple iOS 18 Benchmark v1.1.0 - 06-30-2025\n\n2.2.1.10 Ensure \"Allow Handoff\" is set to \"Disabled\"","lastModifiedDateTime":"2025-08-10T15:15:56.9731165Z","name":"Private - CIS Level 2 - Allow Activity Continuation","platforms":"iOS","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm,appleRemoteManagement","id":"440ccd50-3d83-4293-8c6a-18ae4264b31a","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"com.apple.applicationaccess_com.apple.applicationaccess","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"com.apple.applicationaccess_allowactivitycontinuation","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"com.apple.applicationaccess_allowactivitycontinuation_false","children":[]}}]}]}}]}